shijoe4/zephyr/ext/hal/nxp/mcux/devices/MKW41Z4/MKW41Z4.xml
        <register>
          <name>CCA_ED_LQI_CTRL_1</name>
          <description>RX_DIG CCA ED LQI Control Register 1</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_NOISE_AVG_DELAY</name>
              <description>RSSI Noise Averaging Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_NOISE_AVG_FACTOR</name>
              <description>RSSI Noise Averaging Factor</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>64</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>70</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>128</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>139</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>256</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>277</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>512</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LQI_RSSI_WEIGHT</name>
              <description>LQI RSSI Weight</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>2.0</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>2.125</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2.25</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>2.375</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>2.5</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>2.625</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>2.75</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>2.875</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LQI_RSSI_SENS</name>
              <description>LQI RSSI Sensitivity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNR_LQI_DIS</name>
              <description>SNR LQI Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The RX_DIG CCA/ED/LQI block ignores the AA match input which starts an LQI measurement.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_SNR_MODE</name>
              <description>Select SNR Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SNR estimate</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Mapped correlation magnitude</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEAS_TRANS_TO_IDLE</name>
              <description>Measurement Transition to IDLE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Module transitions to RSSI state</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Module transitions to IDLE state</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA1_ED_EN_DIS</name>
              <description>CCA1_ED_EN Disable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CCA1_ED_EN input is disabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_MEAS_COMPLETE</name>
              <description>Manual measurement complete</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Manually asserts the measurement complete signal for the RX_DIG CCA/ED/LQI blocks. Intended to be used only for debug.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_AA_MATCH</name>
              <description>Manual AA Match</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Manually asserts the AA match signal for the RX_DIG CCA/ED/LQI and AGC blocks. Intended to be used only for debug.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNR_LQI_WEIGHT</name>
              <description>SNR LQI Weight</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0.0</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1.0</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1.125</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1.25</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>1.375</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>1.5</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>1.625</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>1.75</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>1.875</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>2.0</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>2.125</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>2.25</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>2.375</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>2.5</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>2.625</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>2.75</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LQI_BIAS</name>
              <description>LQI Bias.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_ED_LQI_STAT_0</name>
          <description>RX_DIG CCA ED LQI Status Register 0</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LQI_OUT</name>
              <description>LQI output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ED_OUT</name>
              <description>ED output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNR_OUT</name>
              <description>SNR output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA1_STATE</name>
              <description>CCA1 State</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_COMPLETE</name>
              <description>Measurement Complete</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_0</name>
          <description>Receive Channel Filter Coefficient 0</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H0</name>
              <description>RX Channel Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_1</name>
          <description>Receive Channel Filter Coefficient 1</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H1</name>
              <description>RX Channel Filter Coefficient 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_2</name>
          <description>Receive Channel Filter Coefficient 2</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H2</name>
              <description>RX Channel Filter Coefficient 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_3</name>
          <description>Receive Channel Filter Coefficient 3</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H3</name>
              <description>RX Channel Filter Coefficient 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_4</name>
          <description>Receive Channel Filter Coefficient 4</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H4</name>
              <description>RX Channel Filter Coefficient 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_5</name>
          <description>Receive Channel Filter Coefficient 5</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H5</name>
              <description>RX Channel Filter Coefficient 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_6</name>
          <description>Receive Channel Filter Coefficient 6</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H6</name>
              <description>RX Channel Filter Coefficient 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_7</name>
          <description>Receive Channel Filter Coefficient 7</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H7</name>
              <description>RX Channel Filter Coefficient 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_8</name>
          <description>Receive Channel Filter Coefficient 8</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H8</name>
              <description>RX Channel Filter Coefficient 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_9</name>
          <description>Receive Channel Filter Coefficient 9</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H9</name>
              <description>RX Channel Filter Coefficient 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_10</name>
          <description>Receive Channel Filter Coefficient 10</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H10</name>
              <description>RX Channel Filter Coefficient 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CHF_COEF_11</name>
          <description>Receive Channel Filter Coefficient 11</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CH_FILT_H11</name>
              <description>RX Channel Filter Coefficient 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_MAN_AGC_IDX</name>
          <description>AGC Manual AGC Index</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_MAN_IDX</name>
              <description>AGC Manual Index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_MAN_IDX_EN</name>
              <description>AGC Manual Index Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_DCOC_START_PT</name>
              <description>AGC DCOC Start Point</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
